In [4]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv("student_practice.csv")

In [6]:
df

    ID    Name  Age Department  CGPA
0  101   Rahim   23        CSE   3.5
1  102   Karim   25        EEE   3.2
2  103  Ayesha   22        BBA   3.8
3  104   Salma   24        CSE   3.6
4  105   Jamil   26    English   3.1

In [8]:
df.loc[2]

ID               103
Name          Ayesha
Age               22
Department       BBA
CGPA             3.8
Name: 2, dtype: object

In [12]:
df.loc[[0,2,4]]

    ID    Name  Age Department  CGPA
0  101   Rahim   23        CSE   3.5
2  103  Ayesha   22        BBA   3.8
4  105   Jamil   26    English   3.1

In [15]:
df.loc[1:3]

    ID    Name  Age Department  CGPA
1  102   Karim   25        EEE   3.2
2  103  Ayesha   22        BBA   3.8
3  104   Salma   24        CSE   3.6

In [18]:
df.loc[ : , "Name"]

0     Rahim
1     Karim
2    Ayesha
3     Salma
4     Jamil
Name: Name, dtype: object

In [19]:
df.loc[ : , ["Name", "Age"]]

     Name  Age
0   Rahim   23
1   Karim   25
2  Ayesha   22
3   Salma   24
4   Jamil   26

In [20]:
df.loc[1, "Name"]

'Karim'

In [21]:
df.loc[[1,2], ["Name", "Age"]]

     Name  Age
1   Karim   25
2  Ayesha   22

In [22]:
df.loc[0 : 2, "Name" : "Age"]

     Name  Age
0   Rahim   23
1   Karim   25
2  Ayesha   22

In [23]:
df.loc[df["Age"] > 23]

    ID   Name  Age Department  CGPA
1  102  Karim   25        EEE   3.2
3  104  Salma   24        CSE   3.6
4  105  Jamil   26    English   3.1

In [24]:
df.loc[df["Age"] > 23, ["Name", "Age"]]

    Name  Age
1  Karim   25
3  Salma   24
4  Jamil   26

In [28]:
newdf = df.copy()

In [29]:
newdf

    ID    Name  Age        Department  CGPA
0  101   Rahim   23  Computer Science   3.5
1  102   Karim   25               EEE   3.2
2  103  Ayesha   22               BBA   3.8
3  104   Salma   24  Computer Science   3.6
4  105   Jamil   26           English   3.1

In [30]:
newdf.loc[df["Department"] == "CSE", "Department"] = "Computer science and Enginnering"

In [31]:
newdf

    ID    Name  Age        Department  CGPA
0  101   Rahim   23  Computer Science   3.5
1  102   Karim   25               EEE   3.2
2  103  Ayesha   22               BBA   3.8
3  104   Salma   24  Computer Science   3.6
4  105   Jamil   26           English   3.1

In [32]:
newdf.describe()

               ID        Age      CGPA
count    5.000000   5.000000  5.000000
mean   103.000000  24.000000  3.440000
std      1.581139   1.581139  0.288097
min    101.000000  22.000000  3.100000
25%    102.000000  23.000000  3.200000
50%    103.000000  24.000000  3.500000
75%    104.000000  25.000000  3.600000
max    105.000000  26.000000  3.800000